In [130]:
# Import classes from database managemnt class db_connection in db_connection.ipynb file

In [131]:
%run db_connection.ipynb

mongo = db_connection()
"""
def update_inventories():
    return mongo.get_inventories()
def update_transactions():
    return mongo.get_transactions
def update_orders():
    return mongo.get_orders"""

'\ndef update_inventories():\n    return mongo.get_inventories()\ndef update_transactions():\n    return mongo.get_transactions\ndef update_orders():\n    return mongo.get_orders'

In [132]:
import pandas as pd

In [133]:
def get_actor_inventory_df(actor_id):
    data=mongo.get_actor_inventory(1)
    return pd.DataFrame(data["inventory_"+str(1)][0])

In [150]:
def get_actor_orders_df(actor_id):
    data=mongo.get_actor_orders(actor_id)
    return pd.DataFrame(data["orders_"+str(actor_id)][0])

In [153]:
def get_transactions_df():
    data=mongo.get_transactions()
    return pd.DataFrame(data["orders_"+str(actor_id)][0])

,_id,actor_id,order_time,product,quantity,client,status,close_time
0,2000001,2,2,2001,2,1,1,2.0
1,2000002,2,4,2001,2,1,1,4.0
2,2000003,2,5,2001,2,1,1,6.0
3,2000004,2,6,2001,2,1,1,8.0
4,2000005,2,6,2001,2,1,0,NaN
5,2000006,2,7,2001,2,1,0,NaN
6,2000007,2,7,2001,2,1,0,NaN
7,2000008,2,8,2001,2,1,0,NaN
8,2000009,2,8,2001,2,1,0,NaN
9,2000010,2,8,2001,2,1,0,NaN
10,2000011,2,8,2001,2,1,0,NaN
11,2000012,2,9,2001,2,1,0,NaN
12,2000013,2,9,2001,2,1,0,NaN
13,2000014,2,9,2001,2,1,0,NaN
14,2000015,2,9,2001,2,1,0,NaN

In [ ]:
x=mongo.get_transactions()
x

In [187]:
transactions= pd.DataFrame(x["transactions"][0], columns=["transaction_id","deliver_day","order_id","sending_day","receiver","sender","product","quantity","delivered","last_update","recording_time"])
transactions

,transaction_id,deliver_day,order_id,sending_day,receiver,sender,product,quantity,delivered,last_update,recording_time
0,1,2,1000001,1,0,1,1001,3,0,1,NaN
1,2,2,3000001,1,1,3,3001,2,1,1,2.0
2,3,3,2000001,2,1,2,2001,2,1,2,3.0
3,4,5,2000002,4,1,2,2001,2,0,4,NaN
4,5,5,3000002,4,2,3,3001,2,0,4,NaN
5,6,5,4000001,4,3,4,4001,2,1,4,5.0
6,7,7,1000002,6,0,1,1001,10,0,6,NaN
7,8,7,1000003,6,0,1,1001,1,0,6,NaN
8,9,7,2000003,6,1,2,2001,2,0,6,NaN
9,10,7,3000003,6,2,3,3001,2,0,6,NaN
10,11,7,4000002,6,3,4,4001,2,0,6,NaN
11,12,7,5000001,6,4,5,5001,2,1,6,7.0
12,13,9,1000004,8,0,1,1001,1,0,8,NaN
13,14,9,2000004,8,1,2,2001,2,0,8,NaN
14,15,9,3000004,8,2,3,3001,2,0,8,NaN
15,16,9,4000003,8,3,4,4001,2,0,8,NaN
16,17,9,5000002,8,4,5,5001,2,1,8,9.0

In [137]:
y

    _id  quantity  last_update
0  2001         3            9
1  3001         0            9